In [2]:
import pandas as pd
import numpy as np

In [ ]:
def printFunction(element : object,printString=""):
    print(printString,"\n",element,"\n")

### Series

In the context of the pandas library in Python, a Series refers to a one-dimensional labeled array.

In [ ]:
labels = ['a','b','c']
my_data = [10,20,30]
np_arr = np.array(my_data)
myDict = {0:my_data,1:labels}

printFunction(pd.Series(data=my_data,index=labels),"We define a Series and gives index, This can't be done in Numpy ")
printFunction(pd.Series(data=np_arr,index=labels),"We define a Series through Numpy array, and gives Indexes")
printFunction(pd.Series(myDict),"We define a Series through Dictionary, keys become indexes automatically")
pd1 = pd.Series(myDict)
printFunction(pd1[0]," Access the element of Series by naming index")
printFunction(pd1[[0,1]]," Access Multiple element of Series by giving list of indexes")

### DataFrames

In the context of the pandas library in Python, DataFrame is a two-dimensional, tabular data structure. It is one of the most widely used data structures for data analysis and manipulation. The DataFrame is similar to a spreadsheet or a SQL table

In [ ]:
indexes = ['a','b','c']
cols = ['x','y','z']
my_data = [[10,20,30],[40,50,60],[70,80,90]]

df = pd.DataFrame(data=my_data,index=indexes,columns=cols)
printFunction(df,"Now as dataframe is multidimesnional, it is collection of series along with column names")
printFunction(df['x'],"You can access whole column by subscript method, but can't access row by subscript method")
printFunction(df.loc['a'],"You can access whole row by subscript method using loc and index name")
printFunction(df.loc[['a','b']],"You can access multiple whole rows by subscript method using loc and index names")
printFunction(df.iloc[0],"You can access whole row by subscript method using iloc and index number")
printFunction(df.iloc[[0,1]],"You can access multiple whole rows by subscript method using iloc and index numbers")
#The difference between loc and iloc is, loc require you to write names of index and column, iloc requires numbers
printFunction(df.loc['a','x'],"You can access a particular value of 2-d array using loc")
printFunction(df.loc[['a','b'],['x','y']],"You can access a subset of 2-d array using loc")
printFunction(df.iloc[0,0],"You can access a particular value of 2-d array using iloc")
printFunction(df.iloc[[0,1],[0,1]],"You can access a subset of 2-d array using iloc")

In [ ]:
df['newColumn']=df['x'] + df['y'] 
printFunction(df,"You can access a subset of 2-d array using iloc")
df.drop(labels=['newColumn'],axis=1)
df.drop(labels=['a'],axis=0)

In [ ]:
df.shape

In [ ]:
printFunction(df[df>20],"This will return a complete True/False 2d arr, and where it is False will become Nan")
#But we dont want Nan we want to get only those values which pass the test of a particular Column/Row
printFunction(df[df['y']>20],"This will return whole subset of 2d arr, which satisfy your column condition")
printFunction(df[(df['y']>20) & (df['z']>60)],"This will return whole subset of 2d arr, which satisfy your columns multiple condition")
printFunction(df[(df['y']>20) | (df['z']>60)],"This will return whole subset of 2d arr, which satisfy your columns multiple condition")
printFunction(df[(df['y']>20) & (df['z']>60)][['x','y']],"This will return whole subset of 2d arr, which satisfy your columns multiple condition, and we are subscripting it again to get particular columns")

In [ ]:
printFunction(df.reset_index(),"Reset your Indexes to integers, and make a column of old indexes")
printFunction(df.set_index('newColumn'),"Set your Indexes to specified column, but will not make a new column of old indexes")

In [18]:
myDict = {"A":[1,2,np.nan],'B':[3,np.nan,np.nan],"C":[6,7,8]}

df = pd.DataFrame(data=myDict)
df

     A    B  C
0  1.0  3.0  6
1  2.0  NaN  7
2  NaN  NaN  8

### Drop and Fill NA Values

In [22]:
df.dropna() #Drop any row which has 1 or more nan value
df.dropna(axis=1) #Drop any column which has 1 or more nan value
df.dropna(axis=1,thresh=2) #Drop when total value is equal or more to threshold value

df.fillna(value="Filler")
df['A'].fillna(value=df['A'].median())

        A       B  C
0     1.0     3.0  6
1     2.0  Filler  7
2  Filler  Filler  8

### GroupBy in Pandas

In [35]:
myDict = {"Company":["Google","Google","Microsoft","Microsoft","Facebook","Facebook","Google"],
          'Employee':["Farhan","Samar","Ashwin","Peter","Aasim","Derrick","Omer"],
          "Salary":[200,300,200,350,120,134,232],
         "Age":[24,38,31,28,31,33,40]}

employeeDf = pd.DataFrame(data=myDict)

In [36]:
employeeDf.groupby("Company").sum()

           Salary  Age
Company
Facebook      254   64
Google        732  102
Microsoft     550   59

In [43]:
employeeDf.groupby("Company")[["Salary","Age"]].min() #Get only Salary and Age, if you dont min can operate and return on employee column as well
employeeDf.groupby("Company").sum().loc['Facebook']  #After summing just show Facebook data

           Salary  Age
Company
Facebook      120   31
Google        200   24
Microsoft     200   28

In [49]:
employeeDf.groupby("Company").describe() #For all Numeric Columns get the data based on group 
employeeDf.groupby("Company").describe()['Salary'] #To see only salary Columns data based on group
employeeDf.groupby("Company").describe().loc['Facebook'] #To see only Facebook Row data based on group

Salary  count      2.000000
        mean     127.000000
        std        9.899495
        min      120.000000
        25%      123.500000
        50%      127.000000
        75%      130.500000
        max      134.000000
Age     count      2.000000
        mean      32.000000
        std        1.414214
        min       31.000000
        25%       31.500000
        50%       32.000000
        75%       32.500000
        max       33.000000
Name: Facebook, dtype: float64

### Merging and Concatenating Dataframes

In [52]:
df1= pd.DataFrame(data=[[1,2,3],[4,5,6]],columns=["A","B","C"])
df2= pd.DataFrame(data=[[7,8,9],[10,11,12]],columns=["A","B","C"])

In [53]:
 pd.concat([df1,df2]) #Dimesnions should match along the axix

    A   B   C
0   1   2   3
1   4   5   6
0   7   8   9
1  10  11  12

In [54]:
pd.concat([df1,df2],axis=1)

   A  B  C   A   B   C
0  1  2  3   7   8   9
1  4  5  6  10  11  12

### Multi-Indexing Heirarchy in Dataframes

In [3]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [15]:
df = pd.DataFrame(data=np.random.randn(6,2), index=hier_index, columns=['A','B'])

In [16]:
df

             A         B
G1 1  0.706672 -0.373391
   2  0.676670  0.662702
   3  0.223108  0.291182
G2 1 -0.238606  1.820864
   2 -0.818415  0.710404
   3  2.595709 -0.277886

In [17]:
df.loc['G1'].loc[3]

A    0.223108
B    0.291182
Name: 3, dtype: float64